app/views/histories/show.html.haml

          Autor:
          - u = User.find(@history.user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 34]]

          Categoria(s):
          - Category.find(@history.category_ids).each do |c|
---
SELECT "categories".id FROM "categories" INNER JOIN "categories_histories" ON "categories"."id" = "categories_histories"."category_id" WHERE "categories_histories"."history_id" = 64 ORDER BY addcategory

          Classificação:
          - cl = Classification.find(@history.classification_id)
---
SELECT "classifications".* FROM "classifications" WHERE "classifications"."id" = ? LIMIT 1  [["id", 1]]