app/controllers/categories_controller.rb

  def histories
    @category = Category.find(params[:id])
    @histories = @category.histories.where("moderate = 2").page(params[:page]).per(3)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? ORDER BY addcategory LIMIT 1  [["id", "1"]]
SELECT "histories".* FROM "histories" INNER JOIN "categories_histories" ON "histories"."id" = "categories_histories"."history_id" WHERE "categories_histories"."category_id" = 1 AND (moderate = 2) LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "histories" INNER JOIN "categories_histories" ON "histories"."id" = "categories_histories"."history_id" WHERE "categories_histories"."category_id" = 1 AND (moderate = 2)