app/controllers/histories_controller.rb

  def show
    @history = History.find(params[:id]) rescue nil
    if !@history
      redirect_to "/"
      return
    end

    if @history.moderate == 3
      redirect_to "/"
      return
    end

    if @history.moderate == 0 && !session[:moderator]
      redirect_to "/"
      return
    end

    if @history.moderate == 0 && session[:moderator]
      @history.moderate = 1
      @history.save
      @history.moderateTime = @history.updated_at
      @history.updated_at = @history.created_at
      @history.save
    end

    if session[:id] && !session[:moderator]
      @user = User.find(session[:id])
---
SELECT "histories".* FROM "histories" WHERE "histories"."id" = ? LIMIT 1  [["id", "64"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 34]]

  def search
    @histories = History.search params[:search]
---
SELECT "histories".* FROM "histories" WHERE (title LIKE '%teste%')