app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "135138680"]]
---
  def show
    @user = params[:id] =~ /^\d+$/ ? User.find(params[:id]) : User.where(nick: params[:id]).first rescue nil

INSERT INTO "users" ("admin", "born_at", "created_at", "email", "hobby", "name", "nick", "password", "situation", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "135138680"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 135138680]]
---
  def destroy
    @user = User.find(params[:id])
    flash[:notice] = "Usuário deletado com sucesso!" if @user.destroy