app/views/categories/histories.html.haml

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 34]]
---
      por
      - u = User.find(history.user_id)

SELECT "categories".id FROM "categories" INNER JOIN "categories_histories" ON "categories"."id" = "categories_histories"."category_id" WHERE "categories_histories"."history_id" = 64 ORDER BY addcategory
---
      Categorias:
      - Category.find(history.category_ids).each do |ct|

SELECT "classifications".* FROM "classifications" WHERE "classifications"."id" = ? LIMIT 1  [["id", 1]]
---
      Classificação:
      - cl = Classification.find(history.classification_id)